raibisch/ESP32_Luxtronik2/src/main.cpp
void notFound(AsyncWebServerRequest *request) 
{
    request->send(404, "text/plain", "Not found");
}

void initWebServer()
{ 
  // --------------- Basis Seiten:----------------------------------
  //Route for root / web page
  webserver.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {https://
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
  //Route for root /index web page
  webserver.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
 
  //Route for setup web page
  webserver.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/setup.html", String(), false, setHtmlVar);
  });
  //Route for config web page
  webserver.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/config.html", String(), false, setHtmlVar);
  });
  //Route for Info-page
  webserver.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/info.html", String(), false, setHtmlVar);
  });

  // config.txt GET
  webserver.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    delay(300);
    //saveHistory();
    ESP.restart();
  });
  //----------------------------------------------------------------------

  // Temp Icons:
  webserver.on("/temp_inside.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/temp_inside.png", String(), false, setHtmlVar);
  });
  
  //Route for Luxtronik details page
  webserver.on("/luxtronik.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/luxtronik.html", String(), false, setHtmlVar);
  });

  //Route for meter page
  webserver.on("/meter.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/meter.html", String(), false, setHtmlVar);
  });
  
  //.. some code for the navigation icons
  webserver.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/home.png", String(), false);
  });
  webserver.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/file-list.png", String(), false);
  });

  webserver.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/settings.png", String(), false);
  });


#ifdef SG_READY
  webserver.on("/smartgrid.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/smartgrid.html", String(), false, setHtmlVar);
  });
  webserver.on("/sgready.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/sgready.html", String(), false, setHtmlVar);
  });
  webserver.on("/reload.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/reload.png", String(), false);
  });
#endif
  
  webserver.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
                                                                      // Index:
    sFetch = ntpclient.getTimeString();                               // 0 = Time: 00:00
    sFetch += ",";
#ifdef SG_READY
    sFetch += smartgrid.getHourVar1(ntpclient.getTimeInfo()->tm_hour);// 1 = sg_status
#else
    sFetch += "-";
#endif
     sFetch += ',';
/* z.Z. Wert von Luxtonic anzeigen !
#ifdef DS100_MODBUS
    sFetch += valDS100_L1_W / 1000;                                    // 2 DS100 Power L1
    sFetch += ',';
#else 
*/
    sFetch += luxws.getval(LUX_VAL_TYPE::POWER_IN, true);              // 2 Power In
    sFetch += luxws.getCSVfetch(true);                                 // 3...36
    sFetch += String(luxws.tempRoom,1);                                // 37
    sFetch += ',';
    sFetch += String(luxws.powerInMeter);                              // 38
    sFetch += ",end";     

    //debug_printf("server.on fetch: %s",sFetch.c_str());
    request->send(200, "text/plain", sFetch);  
  });


  // Route for style-sheet
  webserver.on("/style.css",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/style.css", String(), false);
  });

  // Route for manifest
  webserver.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/manifest.json", String(), false);
  });
  

  // App-Icons
  webserver.on("/current.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/current.png", String(), false);
  });
  webserver.on("/sg.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/sg.png", String(), false);
  });
  webserver.on("/sgready.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/sgready.png", String(), false);
  });
  webserver.on("/heatpump.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/heatpump.png", String(), false);
  });
   webserver.on("/luxtronik.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/luxtronik.png", String(), false);
  });
  webserver.on("/homeauto.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/homeauto.png", String(), false);
  });

  // at index.html Luxtronic status
  webserver.on("/poweroff.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/poweroff.png", String(), false, setHtmlVar);
  });
  
  webserver.on("/hotwater.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/hotwater.png", String(), false);

  }); webserver.on("/radiator.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/radiator.png", String(), false);

  }); webserver.on("/defrost.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/defrost.png", String(), false);
  });

