raibisch/ESP32_Luxtronik2/src/main.cpp
  // fetch GET
  webserver.on("/fetchmeter", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    sFetch = "";
#ifdef DS100_MODBUS   
    sFetch = valDS100_L1_W;       // 0
    sFetch+= ',';
    sFetch+= valDS100_L2_W;       // 1
    sFetch+= ',';               
    sFetch+= valDS100_L3_W;       // 2
    sFetch+= ',';
    sFetch+= valDS100_L1_KWH*10;  // 3
    sFetch+= ',';
    sFetch+= valDS100_L2_KWH*10;  // 4
    sFetch+= ',';
    sFetch+= valDS100_L3_KWH*10;  // 5
    sFetch+= ',';
    sFetch+= valDS100_mV;         //6
#else
    sFetch = "--,--,--,--,--,--,--";
#endif
#if defined SML_TIBBER || defined SML_TASMOTA
    sFetch+= ',';
    sFetch+= smldecoder.getWatt();  // 7
    sFetch+= ',';
    sFetch+= smldecoder.getInputkWh(); // 8
    sFetch+= ',';
    sFetch+= smldecoder.getOutputkWh(); // 9
#else
    sFetch+= ",--,--,--";
#endif
    request->send(200, "text/plain", sFetch);
    //debug_println("server.on /fetchmeter: "+ s);
  });


  // -------------------- POST --------------------------------------------------
   // sgready.html POST
   #ifdef SG_READY
   webserver.on("/sgready.html",          HTTP_POST, [](AsyncWebServerRequest *request)
   {
    uint8_t i = 0;
    int iVal  = request->arg(i).toInt();
    const String sArg = request->argName(0);
    debug_printf(      "sgready POST: arg: %s  value:%d\r\n",sArg.c_str(), iVal);
    AsyncWebLog.printf("sgready POST: arg: %s  value:%d\r\n",sArg.c_str(), iVal);
 
    if (sArg == "sg1")
    {
       setSGreadyOutput(1, iVal);
    }
    else
    if (sArg == "sg2")
    {
       setSGreadyOutput(2, iVal);
    }
    else
    if (sArg == "sg3")
    {
       setSGreadyOutput(3, iVal);
    }
    else
    if (sArg == "sg4")
    {
       setSGreadyOutput(4, iVal);
    }
    else 
    if (sArg == "sgsreload")
    {
     debug_println("sgsreload");
     smartgrid.getAppRules();   // old: setSmartGridRules(); // calulate rules from config
     smartgrid.setAppOutputFromRules(ntpclient.getTimeInfo()->tm_hour);
    }

    request->send(myFS, "/sgready.html", String(), false, setHtmlVar); 
   });
   #endif      

    // config.html POST
    webserver.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
    {
     //debug_println("Argument: " + request->argName(0));
     //debug_println("Value: ");
     uint8_t i = 0;
     String s  = request->arg(i);
     debug_println(s);
     if (request->argName(0) == "saveconfig")
     {
         varStore.Save(s);
         varStore.Load();
#ifdef SG_READY
         smartgrid.refreshWebData(true); // new: 30.10.2024
         smartgrid.getAppRules();   // old: setSmartGridRules(); // calulate rules from config
#endif
     }
     request->send(myFS, "/config.html", String(), false, setHtmlVar);
    });
     
  // init Webserver 
  sFetch.reserve(150);
  AsyncWebLog.begin(&webserver);
  AsyncWebOTA.begin(&webserver);
  webserver.onNotFound(notFound);
  webserver.begin();
  }
#else
  void initWebServer() {};
#endif // WEB_APP


////////////////////////////////////////////////////
/// @brief setup
////////////////////////////////////////////////////
void setup() 
{
  Serial.begin(115200);                                           
  delay(500);
  Serial.println("***START***");
  delay(500);
  initLED();
  initRelay();
  initFS();
  initFileVarStore(); 
  setcolor('b'); // blue
  initWiFi();
  initWebServer(); 
  setLED(0);
  delay(500);
#ifdef EPEX_PRICE
  smartgrid.init();
#endif
#ifdef SML_TIBBER
  smldecoder.init(varStore.varSML_s_url.c_str(), varStore.varSML_s_user.c_str(), varStore.varSML_s_password.c_str());
#endif
#ifdef DS100_MODBUS
  DS100Init();
#endif
#ifdef MQTT_CLIENT
  initMQTT();
#endif
  luxws.init(varStore.varLUX_s_url.c_str(), varStore.varLUX_s_password.c_str());
  delay(1000);
}

///////////////////////////////////// TimePageSprite.drawString(20,10,buf, &Font0);///////////
/// @brief loop
////////////////////////////////////////////////
void loop() 
{
   luxws.loop();
   #ifdef MQTT_CLIENT
   mqtt.loop();
#endif

   if (millis() - TimerSlowDuration > TimerSlow) 
   {
    TimerSlow = millis();                      // Reset time for next event
    testWiFiReconnect();
    ntpclient.update();
    tm* looptm = ntpclient.getTimeInfo();
    debug_printf("\r\nTIME: %s:%02d\r\n", ntpclient.getTimeString(), ntpclient.getTimeInfo()->tm_sec);
    AsyncWebLog.printf("TIME: %s:%02d\r\n", ntpclient.getTimeString(), ntpclient.getTimeInfo()->tm_sec);
#ifdef MQTT_CLIENT
    AsyncWebLog.printf("Raum-Temp: %2.1f \r\n", luxws.tempRoom);
#endif
#ifdef SML_TIBBER
    smldecoder.read(); 
#endif  
#ifdef DS100_MODBUS
    DS100read();
#endif
#ifdef EPEX_PRICE
    time_t tt = ntpclient.getUnixTime();
    smartgrid.loop(&tt);
#endif
    if (looptm->tm_hour == 0 && looptm->tm_min ==0 && looptm->tm_sec < 7)
    { 
      luxws.poll(true); // new Day
    }
    else
    {
      luxws.poll(false);
    }
  
    if (luxws.isConnected())
    {
      AsyncWebLog.printf("WS-POLL-State:        \t %s\r\n", luxws.getval(LUX_VAL_TYPE::STATUS_POLL,     false));
      AsyncWebLog.printf("WP-State:             \t %s\r\n", luxws.getval(LUX_VAL_TYPE::STATUS_HEATPUMP, false));
      //AsyncWebLog.printf("Watt                  \t %d \r\n",smldecoder.getWatt());
      //AsyncWebLog.printf("Leistung OUT-HEAT:    \t %s\r\n", luxws.getval(LUX_VAL_TYPE::ENERGY_OUT_HE, false));
     
    }
    else
    {
       AsyncWebLog.printf("...wait Luxtronik connecting\r\n");
    }
  }
  // fast blink
  static int c4 = 0;
  if (millis() - TimerFastDuration > TimerFast)
  {
#ifdef ESP32_S3_ZERO
  // useless color change ;-)
   c4++;
   if (c4 > 4) {c4 = 0;}
   switch (c4)
  {
    case 0: 
      neopixel_color = 'r';
      break;
    case 1:
      neopixel_color = 'g';
      break;
    case 2:
      neopixel_color = 'b';
      break;
    case 3:
      neopixel_color = 'y';
      break;
    case '4':
      neopixel_color = 'w';
      break;
    default:
       break;
    }
#endif
    TimerFast = millis();
    blinkLED();
  }

}

